AccumulationRegisters/ТТМ_УчетСерийныхНомеровПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТТМ_УчетСерийныхНомеровПродукции</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШильдЗаказан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Произведено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реализовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДополнительныеСведения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЭтаповПроизводства2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЭтаповПроизводства2_2</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Начат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИспользованиеХарактеристик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияХарактеристикНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ТТМ_СерийныйУчет/Ext/Module.bsl
Функция УдалитьЗаписиРегистраПоРегистратору(СсылкаНаЭтап) Экспорт
	
	НЗ = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(СсылканаЭтап.Ссылка);
	НЗ.Прочитать();
	НЗ.Очистить();  
	Попытка
		НЗ.Записать();
		Возврат Истина;
	Исключение  
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;  
	КонецПопытки;
	
КонецФункции

//01.07.2025
//Функция выполняет проверку необходимости ведения серийных номеров
//генерирует серийные номера по количеству изделий в этапе (если задано начальное значение серийного номера, то начинает нумерацию с указанного номера
//На данный момент серийные номера устанавливаются при заказе шильдов из обработки, поэтому устанавливается отметка ШильдЗаказан в значение ИСТИНА в регистре ТТМ_УчетСерийныхНомеров 
Функция ЗаписатьСерийныйНомерПродукцииПослеПроверки(СсылкаНаЭтап, НачальныйНомер = 0) Экспорт 
	// Код написан для случая когда результатом этапа является одна номенклатурная позиция
	// количество может быть больше одного
	
	ДанныеЭтапа = ПолучитьДанныеЭтапа(СсылкаНаЭтап);  
	Номенклатура = СсылкаНаЭтап.Выходныеизделия[0].Номенклатура;	
	
	//УчетСерий = ТТМНеобходимостьИспользованияСерий(); //ДанныеЭтапа.ВидНоменклатуры, ДанныеЭтапа.ДатаЗапуска
	УчетСерий = ПроверитьУстановитьУчетСерийныхНомеров(Номенклатура);
	
	Если не УчетСерий Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	СерииЗаписаны = Ложь;
	
	НЗ = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Значение = СсылкаНаЭтап.Ссылка;
	НЗ.Отбор.Регистратор.Использование = Истина;
	НЗ.Прочитать();
	
	тз = НЗ.Выгрузить();
	
	Если НЗ.Количество() = СсылкаНаЭтап.КоличествоУпаковокПлан  //КоличествоИзделий	!!!!! Только для теста - исправить после обратно на КоличествоУпаковокПлан!!!! //
		и НЗ[0].Номенклатура = Номенклатура Тогда 		//СсылкаНаЭтап.ВыходныеИзделия[0].Номенклатура Тогда 
		
		Если не НЗ[0].ШильдЗаказан Тогда 
			НЗ[0].ШильдЗаказан = Истина;
		КонецЕсли;
		
		НЗ.Записать();
		
		СерииЗаписаны = Истина;
		
	Иначе             
		
		НЗ.Очистить();
		Для й = 1 по ДанныеЭтапа.Количество Цикл 
			СерийныйНомер = СгененироватьСерийныйНомер(ДанныеЭтапа.Номенклатура, ДанныеЭтапа.ДатаЗапуска, й, НачальныйНомер + й - 1);
			СтрНЗ = НЗ.Добавить(); 
			ЗаполнитьЗначенияСвойств(СтрНЗ,ДанныеЭтапа);
			СтрНЗ.Регистратор = СсылкаНаЭтап.Ссылка;
			СтрНЗ.Период = ДанныеЭтапа.ДатаЗапуска;
			СтрНЗ.ВидДвижения = ВидДвиженияНакопления.Приход;
			СтрНЗ.Количество = 1;
			СтрНЗ.СерийныйНомер = СерийныйНомер;
			СтрНЗ.ШильдЗаказан = Истина;
		КонецЦикла;
		Попытка
			НЗ.Записать();
			СерииЗаписаны = Истина;
		Исключение
			СерииЗаписаны = Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат СерииЗаписаны;
		
КонецФункции  

Функция ПолучитьДанныеЭтапа(СсылкаНаЭтап) Экспорт
	
	ДанныеЭтапа = Новый Структура("СсылкаНаЭтап, Склад, Номенклатура, Назначение, ДатаЗапуска, Количество"); //ВидНоменклатуры
	ТЗВыходныеИзделия = СсылкаНаЭтап.ВыходныеИзделия.Выгрузить(,"Получатель, Номенклатура, Назначение, Количество");
	ТЗВыходныеИзделия.Свернуть("Получатель, Номенклатура, Назначение", "Количество");
	ЗаполнитьЗначенияСвойств(ДанныеЭтапа,ТЗВыходныеИзделия[0]); 
	ДанныеЭтапа.Склад = ТЗВыходныеИзделия[0].Получатель;
	//ДанныеЭтапа.ВидНоменклатуры = ДанныеЭтапа.Номенклатура.ВидНоменклатуры;        
	ДанныеЭтапа.ДатаЗапуска = СсылкаНаЭтап.ФактическоеНачалоЭтапа;
	ДанныеЭтапа.Количество = СсылкаНаЭтап.КоличествоУпаковокПлан;
	
	Возврат ДанныеЭтапа;
	
КонецФункции

//Старый вариант по видам номенклатуры
Функция ТТМНеобходимостьИспользованияСерий(ВидНоменклатуры, ДатаЗапуска) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыНоменклатуры.Ссылка КАК ВидНоменклатуры
	               |ПОМЕСТИТЬ ВТ_ВидНоменклатуры
	               |ИЗ
	               |	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	               |ГДЕ
	               |	ВидыНоменклатуры.Ссылка = &Видноменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДополнительныеСведения.Значение КАК Значение,
	               |	ДополнительныеСведения.Свойство.Имя КАК ИмяСвойства,
	               |	ДополнительныеСведения.Свойство КАК Свойство
	               |ИЗ
	               |	ВТ_ВидНоменклатуры КАК ВТ_ВидНоменклатуры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |		ПО (ДополнительныеСведения.Объект ССЫЛКА Справочник.ВидыНоменклатуры)
	               |			И ВТ_ВидНоменклатуры.ВидНоменклатуры = ДополнительныеСведения.Объект
	               |ГДЕ
	               |	ДополнительныеСведения.Свойство = &СвойствоИспользоватьСерии
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДополнительныеСведения.Значение КАК Значение,
	               |	ДополнительныеСведения.Свойство.Имя КАК ИмяСвойства,
	               |	ДополнительныеСведения.Свойство КАК Свойство
	               |ИЗ
	               |	ВТ_ВидНоменклатуры КАК ВТ_ВидНоменклатуры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |		ПО (ДополнительныеСведения.Объект ССЫЛКА Справочник.ВидыНоменклатуры)
	               |			И ВТ_ВидНоменклатуры.ВидНоменклатуры = ДополнительныеСведения.Объект
	               |ГДЕ
	               |	ДополнительныеСведения.Свойство = &СвойствоДатаНачалаУчетаСерий";
	
	Запрос.УстановитьПараметр("СвойствоИспользоватьСерии", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("имя","ИспользоватьСерииТТМ_ТТМ"));
	Запрос.УстановитьПараметр("СвойствоДатаНачалаУчетаСерий", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("имя","ДатаНачалаВеденияСерийныхНомеров_ТТМ"));
	Запрос.УстановитьПараметр("Видноменклатуры", ВидНоменклатуры);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ИспользоватьСерии = МассивРезультатов[1].Выбрать();
	ДатаНачалаИспользованияСерий = МассивРезультатов[2].Выбрать();
	
	Если ИспользоватьСерии.Следующий() и ИспользоватьСерии.Значение 
		и ДатаНачалаИспользованияСерий.Следующий() и ДатаНачалаИспользованияСерий.Значение <= ДатаЗапуска Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

//&НаСервереБезКонтекста
Функция ПроверитьУстановитьУчетСерийныхНомеров(Номенклатура, ВключитьУчетСерийныхНомеров = Ложь) Экспорт
	
	ДополнительныйРеквизит = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","УчитываатьСерийныеНомераНоменклатуры_ТТМ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка,
	               |	НоменклатураДополнительныеРеквизиты.Свойство КАК Свойство,
	               |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	               |ИЗ
	               |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура
	               |	И НоменклатураДополнительныеРеквизиты.Свойство = &ДопРеквизитУчетСерий";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ДопРеквизитУчетСерий",ДополнительныйРеквизит);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() и Выборка.Значение Тогда
		Если ВключитьУчетСерийныхНомеров Тогда 
			Сообщить("Учет серий уже включен для данной номенклатуры " + Выборка.Ссылка + "!");
			Возврат Истина;
		Иначе 
			Возврат Истина;
		КонецЕсли;
	Иначе  
		Если ВключитьУчетСерийныхНомеров Тогда 
			//Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();    
			УстановитьПривилегированныйРежим(Истина);
			НоменклатураОбъект = Номенклатура.ПолучитьОбъект();
			НоваяСтрока = НоменклатураОбъект.ДополнительныеРеквизиты.Добавить();
			НоваяСтрока.Свойство = ДополнительныйРеквизит;
			НоваяСтрока.Значение = Истина;
			Попытка
				НоменклатураОбъект.Записать();         
				УстановитьПривилегированныйРежим(Ложь);
				Возврат Истина;
			Исключение
				Сообщить("Ошибка при записи номенклатуры" + ОписаниеОшибки());
				УстановитьПривилегированныйРежим(Ложь);
				Возврат Ложь;
			КонецПопытки;
		Иначе 
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция СгененироватьСерийныйНомер(Номенклатура, Дата, ПорядковыйНомерЕдиницыИзделия, НачальныйНомер = 0) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеСведения.Значение КАК КодТМ
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |		ПО (Номенклатура.Ссылка = (ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.Номенклатура)))
	               |ГДЕ
	               |	Номенклатура.Ссылка = &Номенклатура
	               |	И ДополнительныеСведения.Свойство = &ТТМСвойствоНомерТМ";               
	ТТМСвойствоНомерТМ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","КодТМ_ТТМ");
	Запрос.УстановитьПараметр("ТТМСвойствоНомерТМ",ТТМСвойствоНомерТМ);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КодТМ0 = Выборка.КодТМ;
		мКодТМ = СтрРазделить(КодТМ0,"TM -+.ТМ",Ложь);
		ЧастьНомера1 = ДополнитьНомерТМВедущимиНулями(мКодТМ[0]);
		ЧастьНомера2 = СтрЗаменить(Формат(Дата,"ДФ=yyyy"),"0","") + Формат(Дата,"ДФ=ММ");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура КАК Номенклатура,
		               |	МАКСИМУМ(ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер) КАК ПоследнийСерийныйНомер
		               |ИЗ
		               |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
		               |ГДЕ
		               |	ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер ПОДОБНО &НачалоСН
		               |	И ТТМ_УчетСерийныхНомеровПродукции.Номенклатура = &Номенклатура
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура";
		
		Запрос.УстановитьПараметр("НачалоСН", СтрШаблон("%1-%2",ЧастьНомера1,Лев(ЧастьНомера2,СтрДлина(ЧастьНомера2)-2)+"%"));  
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		
		Если не ЗначениеЗаполнено(НачальныйНомер) Тогда 
			ПредыдущйНомер = 100;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл                                                        
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПоследнийСерийныйНомер) Тогда 
					МассивСтрокНомера = СтрРазделить(ВыборкаДетальныеЗаписи.ПоследнийСерийныйНомер,"-");
					ПредыдущйНомер = Число(МассивСтрокНомера[2]);
				Иначе   
					ПредыдущйНомер = ПредыдущйНомер;
					//ПредыдущйНомер = ?(ВыборкаДетальныеЗаписи.ПоследнийСерийныйНомер=NUll,ПредыдущйНомер,Число(Прав(ВыборкаДетальныеЗаписи.ПоследнийСерийныйНомер,5)));
				КонецЕсли;
			КонецЦикла;
		Иначе 
			ПредыдущйНомер = Число(НачальныйНомер) - 1;
		КонецЕсли;     

		ЧастьНомера3 = Формат(ПредыдущйНомер + 1, "ЧЦ=4; ЧВН=; ЧГ=0");  //ПорядковыйНомерЕдиницыИзделия
		//ЧастьНомера3 = Формат(ПредыдущйНомер+1,"ЧЦ=4; ЧВН=; ЧГ=0");

		Возврат СтрШаблон("%1-%2-%3",ЧастьНомера1,ЧастьНомера2,ЧастьНомера3);
	Иначе     
		Сообщить("КодТМ для продукции не установлен!",СтатусСообщения.Важное);
		ПустаяСтр = "";
		Возврат ПустаяСтр;
	КонецЕсли;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////

//Формирует корректный новый серийный номер по формату: КодТМ-ПериодЗапускаЭтапаВПроизводство-НовыйНомер
//КодТМ - 4-5 символов
//ПериодЗапускаЭтапаВПроизводство - Год (без "0") - 3 символа + месяц (с ведущим "0") - 2 символа
//НовыйНомер - порядковый номер изделия в пределах года - 4 символа
Функция ПроверитьКорректностьСерийногоНомера(СтрНовыйНомер, СтрокаДанных) Экспорт
	
	////Состав текущегоСерийного номера
	//МассивЧастейТекущийСН = СтрРазделить(СтрокаДанных.СерийныйНомер,"-");
	////Часть1 = МассивЧастейСН[0];
	////Часть2 = МассивЧастейСН[1];
	//НомерТекущий = МассивЧастейТекущийСН[2];  
	//
	//МассивЧастейСтарыйСН = СтрРазделить(СтрокаДанных.СтарыйСерийныйНомер,"-");
	//НомерНовый = МассивЧастейСтарыйСН[2];
	
	ТМНоменклатуры = ПолучитьТМНоменклатуры(СтрокаДанных.Номенклатура);
	Если ТМНоменклатуры = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли; 
	КодТМ = СтрРазделить(ТМНоменклатуры," -+._/(),:;*№#$@!^&`~");
	
	ДатаНачала = СтрокаДанных.ЭтапПроизводства.ФактическоеНачалоЭтапа;
	
	ДатаЗапуска = Формат(Год(ДатаНачала),"ЧРГ=' '; ЧН=Отсутствует") + Формат(Месяц(ДатаНачала),"");
	ДатаЗапуска = СтрЗаменить(Формат(ДатаНачала,"ДФ=yyyy"),"0","") + Формат(ДатаНачала,"ДФ=ММ");
	
	НовыйСерийныйНомер = ДополнитьНомерТМВедущимиНулями(КодТМ[0]) + "-" + ДатаЗапуска + "-" + СтрНовыйНомер;
	
	НомерСвободен = ПроверитьНомерНеЗанят(СтрокаДанных, НовыйСерийныйНомер);
	
	Если НомерСвободен Тогда                                              	
		Возврат НовыйСерийныйНомер;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции   

Функция ДополнитьНомерТМВедущимиНулями(КодТМ)
	
	Если СтрДлина(КодТМ) = 5 Тогда Возврат КодТМ; КонецЕсли;
	
	Пока не СтрДлина(КодТМ) = 5 Цикл 
		КодТМ = "0" + КодТМ;
	КонецЦикла;    
	
	Возврат КодТМ;
	
КонецФункции

Функция ПроверитьНомерНеЗанят(СтрокаДанных, НовыйСерийныйНомер) Экспорт    
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура КАК Номенклатура,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор КАК ЭтапПроизводства,
	               |	ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер КАК СерийныйНомер
	               |ИЗ
	               |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
	               |ГДЕ
	               //|	ТТМ_УчетСерийныхНомеровПродукции.Регистратор = &ЭтапПроизводства
	               |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура = &Номенклатура
	               |	И ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер = &СерийныйНомер";
    //Запрос.УстановитьПараметр("ЭтапПроизводства", СтрокаДанных.ЭтапПроизводства);
	Запрос.УстановитьПараметр("Номенклатура", СтрокаДанных.Номенклатура);
	Запрос.УстановитьПараметр("СерийныйНомер", НовыйСерийныйНомер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Сообщить("Номер "+ НовыйСерийныйНомер +" уже занят: " + Выборка.Номенклатура + ", " + Выборка.ЭтапПроизводства);
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;
	
	Возврат Выборка.Значение;
	
КонецФункции

Функция ПолучитьТМНоменклатуры(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеСведения.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |ГДЕ
	               |	ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура
	               |	И ДополнительныеСведения.Объект = &Номенклатура
	               |	И ДополнительныеСведения.Свойство = &СвойствоТМ";
	Запрос.УстановитьПараметр("номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СвойствоТМ",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","КодТМ_ТТМ"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если не Выборка.Следующий() Тогда 
		Сообщить("Не удалось овпределить код ТМ для номенклатуры " + Номенклатура);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Выборка.Значение;
	
КонецФункции

//Функция записывает конкретный Серийный номер, указанный пользователем
//Параметры:
//СтрНовыйНомер - который нужно записать
//ДанныеТекСтроки - данные текущей строки Таблицы этапов, содержат поля:
//	СтарыйНомер
//	Номенкатура
//	ЭтапПроизводства   
Функция ЗаписатьНовыйСерийныйНомер(СтрНовыйНомер, ДанныеТекСтроки, МассивЭтапов, ПересчитатьВсеВыделенныеНомера = Ложь) Экспорт
	
	УчетСерийныхНомеров = ПроверитьУстановитьУчетСерийныхНомеров(ДанныеТекСтроки.Номенклатура);
	Если не УчетСерийныхНомеров Тогда 
		Сообщить("Учет серийных номеров не включен для номенклатуры " + ДанныеТекСтроки.Номенклатуры);
		Возврат Ложь;
	КонецЕсли;
	//ПараметрыПоиска = Новый Структура("Отметка", Истина); 
	//ТабВыбранныеЭтапы = Объект.ТабЭтапы.Выгрузить(ПараметрыПоиска,);
	НЗ = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
	Если МассивЭтапов.Количество() > 1 Тогда 
		
		Для Каждого Этап из МассивЭтапов Цикл 
			НЗ.Отбор.Регистратор.Установить(ДанныеТекСтроки.ЭтапПроизводства);
			НЗ.Прочитать();
			Для Каждого СтрНЗ из НЗ Цикл 
				Если СтрНЗ.Номенклатура = ДанныеТекСтроки.Номенклатура и СтрНЗ.СерийныйНомер = ДанныеТекСтроки.СтарыйСерийныйНомер Тогда 
					СтрНЗ.СерийныйНомер = СтрНовыйНомер;
					Попытка
						НЗ.Записать();
						Возврат Истина;
					Исключение
						Сообщить(СтрШаблон("Ошибка записи Серийного номера %1, %2, %3", СтрНовыйНомер,ДанныеТекСтроки.Номенклатура, ДанныеТекСтроки.ЭтапПроизводства));
						Возврат Ложь;
					КонецПопытки;
			
					Прервать;
				Иначе 
					Продолжить;
				КонецЕсли;
			КонецЦикла;   
			
		КонецЦикла;
		
	ИначеЕсли МассивЭтапов.Количество() = 1 Тогда 
		
		НЗ.Отбор.Регистратор.Установить(ДанныеТекСтроки.ЭтапПроизводства);
		НЗ.Прочитать(); 
		Если НЗ.Количество() = 0 Тогда 
			//Сгенерировать серийный номер если требуется для Вида номенклатуры
			Если ДанныеТекСтроки.ЭтапПроизводства.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Начат Тогда 
				НомерПроверенИЗаписан = ЗаписатьСерийныйНомерПродукцииПослеПроверки(ДанныеТекСтроки.ЭтапПроизводства);
				Если НомерПроверенИЗаписан Тогда 
					Возврат Истина;
				КонецЕсли;
				Возврат Ложь;
			КонецЕсли; 
			Возврат Ложь;
		КонецЕсли;	
		Для Каждого СтрНЗ из НЗ Цикл 
			Если СтрНЗ.Номенклатура = ДанныеТекСтроки.Номенклатура и СокрЛП(СтрНЗ.СерийныйНомер) = СокрЛП(ДанныеТекСтроки.СерийныйНомер) Тогда 
				СтрНЗ.СерийныйНомер = СтрНовыйНомер;
				Попытка
					НЗ.Записать();
					Возврат Истина;
				Исключение
					Сообщить("Ошибка записи Серийного номера");
					Возврат Ложь;
				КонецПопытки;
				
				Прервать;		
			Иначе 
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Ложь;
		
	Иначе //МассивЭтапов.Количество() = 0
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура СформироватьЗадачуОповещенияОЗапущенныхЭтапах() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "";
	МассивЭтапов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЭтапПроизводства");
	Если МассивЭтапов.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
		
	ТекстСообщения = "";
	Для Каждого Этап из МассивЭтапов Цикл 
		ТекстСообщения = ?(ТекстСообщения = "", "", Символы.ПС) + Этап;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	Задача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
	ДатаЗадачи = ТекущаяДатаСеанса();
	//ПериодОповещения = Дата(Год(ТекущаяДата(),)
	Задача.Дата = ДатаЗадачи;    
	Задача.Наименование = "Запущенные этапы за " + ДатаЗадачи;
	//Задача.Предмет = СсылкаНаЗаказКлиента;
	Задача.Автор = ПараметрыСеанса.ТекущийПользователь; 
	ИсполнительЗадачи = Справочники.Пользователи.НайтиПоНаименованию("Абрамова");
	Задача.Исполнитель = ИсполнительЗадачи;
	Задача.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая;  
	Задача.СрокИсполнения = Дата(Год(ТекущаяДатаСеанса()),Месяц(ТекущаяДатаСеанса()),День(ТекущаяДатаСеанса()+1));
	Задача.Описание = ТекстСообщения;   
	Попытка
		Задача.Записать();                  
	Исключение
		Сообщить("Ошибка при формировании задачи оповещения о запущенных заказах");
	КонецПопытки;
	
	Процесс = БизнесПроцессы.Задание.СоздатьБизнесПроцесс();
	Процесс.ЗадачаИсточник = Задача;
	ЗаполнитьЗначенияСвойств(Процесс,Задача,,"Номер");
	Попытка
		Процесс.Записать();
	Исключение
		
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь); 
	
КонецПроцедуры


//20.03.2026
//Скорректирован подзапрос получения остатков СН с учетом продукции, отгруженной по текущей реализации
//
//06.03.2026  
//Перенесена из модуля подписки
Функция ПроверитьНайтиСерийныйНомерПродукцииПриПродаже(ИсточникРТУ, ЕстьВсеСерии = Истина) Экспорт
	// Код написан для случая когда результатом этапа является одна номенклатурная позиция
	// количество может быть больше одного
	
	ТЗТовары = ИсточникРТУ.Товары.Выгрузить(,"Номенклатура,Количество");
	ТЗТовары.Свернуть("Номенклатура","Количество");
	
	Заказ = ИсточникРТУ.ЗаказКлиента;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВсеТоварыРеализации.Номенклатура КАК Номенклатура,
	               |	ВсеТоварыРеализации.КоличествоУпаковок КАК КоличествоУпаковок
	               |ПОМЕСТИТЬ ВсеТоварыРеализации
	               |ИЗ
	               |	&ТоварыРеализации КАК ВсеТоварыРеализации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВсеТоварыРеализации.Номенклатура КАК Номенклатура,
	               |	СУММА(ВсеТоварыРеализации.КоличествоУпаковок) КАК КоличествоУпаковок
	               |ПОМЕСТИТЬ СерийныеТоварыРеализации
	               |ИЗ
	               |	ВсеТоварыРеализации КАК ВсеТоварыРеализации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |		ПО ВсеТоварыРеализации.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство = &ДопРеквизитУчетСерий
	               |	И НоменклатураДополнительныеРеквизиты.Значение = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВсеТоварыРеализации.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор КАК ЭтапПроизводства,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Склад КАК Склад,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура КАК Номенклатура,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Назначение КАК Назначение,
	               |	ТТМ_УчетСерийныхНомеровПродукции.ШильдЗаказан КАК ШильдЗаказан,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Произведено КАК Произведено,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор.ДатаПроизводства КАК ДатаПроизводства,
	               |	ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер КАК СерийныйНомер,
	               |	СУММА(ТТМ_УчетСерийныхНомеровПродукции.Количество) КАК Количество,
	               |	ТТМ_УчетСерийныхНомеровПродукции.ДокументРеализации КАК ДокументРеализации,
	               |	СерийныеТоварыРеализации.КоличествоУпаковок КАК КоличествоРеализации,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Реализовано КАК Реализовано,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Назначение.Заказ КАК НазначениеЗаказ
	               |ИЗ
	               |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СерийныеТоварыРеализации КАК СерийныеТоварыРеализации
	               |		ПО ТТМ_УчетСерийныхНомеровПродукции.Номенклатура = СерийныеТоварыРеализации.Номенклатура
	               |ГДЕ
	               |	ТТМ_УчетСерийныхНомеровПродукции.ДокументРеализации = &Реализация
	               |	И ТТМ_УчетСерийныхНомеровПродукции.ДатаПроизводства <= &ДатаРеализации
	               |	И НЕ ТТМ_УчетСерийныхНомеровПродукции.Регистратор = &Реализация
	               |	И ТТМ_УчетСерийныхНомеровПродукции.Произведено
	               |	И ТТМ_УчетСерийныхНомеровПродукции.ШильдЗаказан
	               |	И ТТМ_УчетСерийныхНомеровПродукции.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТМ_УчетСерийныхНомеровПродукции.Склад,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Назначение,
	               |	ТТМ_УчетСерийныхНомеровПродукции.ШильдЗаказан,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Произведено,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор,
	               |	ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер,
	               |	ТТМ_УчетСерийныхНомеровПродукции.ДокументРеализации,
	               |	СерийныеТоварыРеализации.КоличествоУпаковок,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Реализовано,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Назначение.Заказ,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор.ДатаПроизводства
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Склад,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Назначение,
	               |	ТТМ_УчетСерийныхНомеровПродукции.ШильдЗаказан,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Произведено,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор.ДатаПроизводства,
	               |	ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер,
	               |	СУММА(ТТМ_УчетСерийныхНомеровПродукции.Количество),
	               |	ТТМ_УчетСерийныхНомеровПродукции.ДокументРеализации,
	               |	СерийныеТоварыРеализации.КоличествоУпаковок,
	               |	ЛОЖЬ,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Назначение.Заказ
	               |ИЗ
	               |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СерийныеТоварыРеализации КАК СерийныеТоварыРеализации
	               |		ПО ТТМ_УчетСерийныхНомеровПродукции.Номенклатура = СерийныеТоварыРеализации.Номенклатура
	               |ГДЕ
	               |	ТТМ_УчетСерийныхНомеровПродукции.Назначение.Заказ = &Заказ
	               |	И ТТМ_УчетСерийныхНомеровПродукции.Произведено
	               |	И ТТМ_УчетСерийныхНомеровПродукции.ДатаПроизводства <= &ДатаРеализации
	               |	И ЕСТЬNULL(ТТМ_УчетСерийныхНомеровПродукции.ДокументРеализации, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	               |	И НЕ ТТМ_УчетСерийныхНомеровПродукции.Реализовано
	               |	И ТТМ_УчетСерийныхНомеровПродукции.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТМ_УчетСерийныхНомеровПродукции.Склад,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Назначение,
	               |	ТТМ_УчетСерийныхНомеровПродукции.ШильдЗаказан,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Произведено,
	               |	ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер,
	               |	ТТМ_УчетСерийныхНомеровПродукции.ДокументРеализации,
	               |	СерийныеТоварыРеализации.КоличествоУпаковок,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Назначение.Заказ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СерийныйНомер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СерийныеТоварыРеализации.Номенклатура КАК Номенклатура,
	               |	СерийныеТоварыРеализации.КоличествоУпаковок КАК КоличествоУпаковок
	               |ИЗ
	               |	СерийныеТоварыРеализации КАК СерийныеТоварыРеализации";     

	Запрос.УстановитьПараметр("Заказ", ИсточникРТУ.ЗаказКлиента);
	Запрос.УстановитьПараметр("Номенклатура", ТЗТовары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Склад", ИсточникРТУ.Склад);
	Запрос.УстановитьПараметр("ДатаРеализации", ИсточникРТУ.Дата); 
	Запрос.УстановитьПараметр("Реализация", ИсточникРТУ.Ссылка); 
	Запрос.УстановитьПараметр("ТоварыРеализации", ИсточникРТУ.Товары.Выгрузить(,"Номенклатура, КоличествоУпаковок"));
	
	ДополнительныйРеквизит = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","УчитываатьСерийныеНомераНоменклатуры_ТТМ");
	Запрос.УстановитьПараметр("ДопРеквизитУчетСерий", ДополнительныйРеквизит);
		
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	РезультатУчетСерий = МассивРезультатов[3];       //[0]
	РезультатЗапроса = МассивРезультатов[2];         //[1]
		
	Если РезультатУчетСерий.Пустой() Тогда 
		ЕстьВсеСерии = Истина;        
		Возврат Неопределено
	КонецЕсли;
	
	Если РезультатЗапроса.Пустой() и не РезультатУчетСерий.пустой() Тогда 
		Сообщить("Отсутствуют остатки серийных номеров для реализации продукции!"); 
		ЕстьВсеСерии = Ложь;
		Возврат Неопределено;
	КонецЕсли;    
	
	//******************************************************************************//    
	
	ТабДоступныеСерии = РезультатЗапроса.Выгрузить();    // ТабДоступныеСерии.ЗаполнитьЗначения(ПредопределенноеЗначение(Документы.РеализацияТоваровУслуг.ПустаяСсылка()),"ДокументРеализации");
	ПараметрыПоиска = Новый Структура("ДокументРеализации", ИсточникРТУ.Ссылка); 
	//ТабДоступныеСерии = Новый ТаблицаЗначений;    
	ТабСтрокиПривязанныеКРеализации = ТабДоступныеСерии.Скопировать(ПараметрыПоиска,); 
	ЕстьПривязанныеСтроки = ТабСтрокиПривязанныеКРеализации.Количество() > 0;  //* не используется пока *//
		
	ЕстьВсеСН = Истина;
	СообщениеНЕдостаточноСерийныхНомеров = "";
	ТЗРезультат = ТабДоступныеСерии.Скопировать();
	ТЗРезультат.Очистить();
	  
	Подобрано = 0;
	Для Каждого СтрокаРеализации Из ТабДоступныеСерии Цикл   
		
		СтруктураОтбора = Новый Структура("Номенклатура",СтрокаРеализации.Номенклатура);
		ДоступныеСерийныеНомера = ТабДоступныеСерии.НайтиСтроки(СтруктураОтбора);
		ПодобранныеСерийныеНомера = ТЗРезультат.НайтиСтроки(СтруктураОтбора);
		Если ПодобранныеСерийныеНомера.Количество() = СтрокаРеализации.КоличествоРеализации Тогда 
			Подобрано = 0; //на всякий случай
			Продолжить;
		КонецЕсли;   
		
		Если ДоступныеСерийныеНомера.Количество() < СтрокаРеализации.КоличествоРеализации Тогда
			СообщениеНЕдостаточноСерийныхНомеров = ?(ЗначениеЗаполнено(СообщениеНЕдостаточноСерийныхНомеров), 
														СообщениеНЕдостаточноСерийныхНомеров + символы.ПС,
														СообщениеНЕдостаточноСерийныхНомеров) + СтрокаРеализации.Номенклатура; 
			ЕстьВсеСН = Ложь; 
			Прервать;
		КонецЕсли;
		
		Для н = 1 по СтрокаРеализации.Количество Цикл
			НоваяСтрока = ТЗРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаРеализации);
			НоваяСтрока.ДокументРеализации = ИсточникРТУ.Ссылка;
			НоваяСтрока.Реализовано = Истина;  
			Подобрано = Подобрано + 1;
		КонецЦикла;
		
		Если Подобрано = СтрокаРеализации.КоличествоРеализации Тогда  
			Подобрано = 0;
		КонецЕсли; 
		
	КонецЦикла;       
	
	ЕстьВсеСерии = ЕстьВсеСН;
	
	Если ЗначениеЗаполнено(СообщениеНЕдостаточноСерийныхНомеров) Тогда 
		ОбщегоНазначения.СообщитьПользователю("Не удалось подобрать достаточно серийных номеров для реализации продукции:" + Символы.ПС + СтрокаРеализации.Номенклатура);
	КонецЕсли; 
	
	Если не ЕстьВсеСерии Тогда 
		Возврат Неопределено;
	Иначе 
		Возврат ТЗРезультат;
	КонецЕсли;
	
КонецФункции  


//06.03.2026  
//Перенесена из модуля подписки
Функция ПроверитьНайтиСерийныйНомерПродукцииПриПродаже_Старая(ИсточникРТУ, ЕстьВсеСерии = Истина) Экспорт
	// Код написан для случая когда результатом этапа является одна номенклатурная позиция
	// количество может быть больше одного
	
	ТЗТовары = ИсточникРТУ.Товары.Выгрузить(,"Номенклатура,Количество");
	ТЗТовары.Свернуть("Номенклатура","Количество");
	
	Заказ = ИсточникРТУ.ЗаказКлиента;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВсеТоварыРеализации.Номенклатура КАК Номенклатура,
	               |	ВсеТоварыРеализации.КоличествоУпаковок КАК КоличествоУпаковок
	               |ПОМЕСТИТЬ ВсеТоварыРеализации
	               |ИЗ
	               |	&ТоварыРеализации КАК ВсеТоварыРеализации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВсеТоварыРеализации.Номенклатура КАК Номенклатура,
	               |	СУММА(ВсеТоварыРеализации.КоличествоУпаковок) КАК КоличествоУпаковок
	               |ПОМЕСТИТЬ СерийныеТоварыРеализации
	               |ИЗ
	               |	ВсеТоварыРеализации КАК ВсеТоварыРеализации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
				   |		ПО ВсеТоварыРеализации.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
				   |ГДЕ
				   |	НоменклатураДополнительныеРеквизиты.Свойство = &ДопРеквизитУчетСерий
				   |	И НоменклатураДополнительныеРеквизиты.Значение = ИСТИНА
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	ВсеТоварыРеализации.Номенклатура
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Склад КАК Склад,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура КАК Номенклатура,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение.Заказ КАК НазначениеЗаказ,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение КАК Назначение,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.СерийныйНомер КАК СерийныйНомер,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.ШильдЗаказан КАК ШильдЗаказан,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Произведено КАК Произведено,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДатаПроизводства КАК ДатаПроизводства,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДокументРеализации КАК ДокументРеализации,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.КоличествоОстаток КАК Количество,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Реализовано КАК Реализовано,
				   |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор КАК ЭтапПроизводства,
				   |	СерийныеТоварыРеализации.КоличествоУпаковок КАК КоличествоРеализации
				   |ИЗ
				   |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции.Остатки(
				   |			,
				   |			Склад = &Склад
				   |				И Номенклатура В (&Номенклатура)
				   |				И Назначение.Заказ = &Заказ
				   |				И Произведено
				   |				И НАЧАЛОПЕРИОДА(ДатаПроизводства, ДЕНЬ) <= НАЧАЛОПЕРИОДА(&ДатаРеализации, ДЕНЬ)
				   |				И ДокументРеализации = &Реализация) КАК ТТМ_УчетСерийныхНомеровПродукцииОстатки
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
				   |		ПО (ТТМ_УчетСерийныхНомеровПродукции.Номенклатура = ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура)
				   |			И (ТТМ_УчетСерийныхНомеровПродукции.Назначение = ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение)
				   |			И (ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер = ТТМ_УчетСерийныхНомеровПродукцииОстатки.СерийныйНомер)
				   |			И (ТТМ_УчетСерийныхНомеровПродукции.ДокументРеализации = ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДокументРеализации)
				   |			И (ТТМ_УчетСерийныхНомеровПродукции.ДатаПроизводства = ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДатаПроизводства)
				   |		ЛЕВОЕ СОЕДИНЕНИЕ СерийныеТоварыРеализации КАК СерийныеТоварыРеализации
				   |		ПО ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура = СерийныеТоварыРеализации.Номенклатура
				   |ГДЕ
				   |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
				   |
				   |ОБЪЕДИНИТЬ ВСЕ
				   |
				   |ВЫБРАТЬ
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Склад,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение.Заказ,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.СерийныйНомер,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.ШильдЗаказан,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Произведено,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДатаПроизводства,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДокументРеализации,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.КоличествоОстаток,
				   |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.Реализовано,
				   |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор,
				   |	СерийныеТоварыРеализации.КоличествоУпаковок
				   |ИЗ
				   |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции.Остатки(
				   |			,
				   |			Склад = &Склад
				   |				И Номенклатура В (&Номенклатура)
				   |				И Назначение.Заказ = &Заказ
				   |				И Произведено
				   |				И НАЧАЛОПЕРИОДА(ДатаПроизводства, ДЕНЬ) <= НАЧАЛОПЕРИОДА(&ДатаРеализации, ДЕНЬ)
				   |				И ЕСТЬNULL(ДокументРеализации, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК ТТМ_УчетСерийныхНомеровПродукцииОстатки
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
				   |		ПО (ТТМ_УчетСерийныхНомеровПродукции.Номенклатура = ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура)
				   |			И (ТТМ_УчетСерийныхНомеровПродукции.Назначение = ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение)
				   |			И (ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер = ТТМ_УчетСерийныхНомеровПродукцииОстатки.СерийныйНомер)
				   |			И (ТТМ_УчетСерийныхНомеровПродукции.ДокументРеализации = ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДокументРеализации)
				   |			И (ТТМ_УчетСерийныхНомеровПродукции.ДатаПроизводства = ТТМ_УчетСерийныхНомеровПродукцииОстатки.ДатаПроизводства)
				   |		ЛЕВОЕ СОЕДИНЕНИЕ СерийныеТоварыРеализации КАК СерийныеТоварыРеализации
				   |		ПО ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура = СерийныеТоварыРеализации.Номенклатура
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	СерийныйНомер
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	СерийныеТоварыРеализации.Номенклатура КАК Номенклатура,
				   |	СерийныеТоварыРеализации.КоличествоУпаковок КАК КоличествоУпаковок
				   |ИЗ
				   |	СерийныеТоварыРеализации КАК СерийныеТоварыРеализации";     

	Запрос.УстановитьПараметр("Заказ", ИсточникРТУ.ЗаказКлиента);
	Запрос.УстановитьПараметр("Номенклатура", ТЗТовары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Склад", ИсточникРТУ.Склад);
	Запрос.УстановитьПараметр("ДатаРеализации", ИсточникРТУ.Дата); 
	Запрос.УстановитьПараметр("Реализация", ИсточникРТУ.Ссылка); 
	Запрос.УстановитьПараметр("ТоварыРеализации", ИсточникРТУ.Товары.Выгрузить(,"Номенклатура, КоличествоУпаковок"));
	
	ДополнительныйРеквизит = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","УчитываатьСерийныеНомераНоменклатуры_ТТМ");
	Запрос.УстановитьПараметр("ДопРеквизитУчетСерий", ДополнительныйРеквизит);
		
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	РезультатУчетСерий = МассивРезультатов[3];       //[0]
	РезультатЗапроса = МассивРезультатов[2];         //[1]
		
	Если РезультатУчетСерий.Пустой() Тогда 
		ЕстьВсеСерии = Истина;        
		Возврат Неопределено
	КонецЕсли;
	
	Если РезультатЗапроса.Пустой() и не РезультатУчетСерий.пустой() Тогда 
		Сообщить("Отсутствуют остатки серийных номеров для реализации продукции!"); 
		ЕстьВсеСерии = Ложь;
		Возврат Неопределено;
	КонецЕсли;    
	
	//******************************************************************************//    
	
	ТабДоступныеСерии = РезультатЗапроса.Выгрузить();    // ТабДоступныеСерии.ЗаполнитьЗначения(ПредопределенноеЗначение(Документы.РеализацияТоваровУслуг.ПустаяСсылка()),"ДокументРеализации");
	ПараметрыПоиска = Новый Структура("ДокументРеализации", ИсточникРТУ.Ссылка); 
	//ТабДоступныеСерии = Новый ТаблицаЗначений;    
	ТабСтрокиПривязанныеКРеализации = ТабДоступныеСерии.Скопировать(ПараметрыПоиска,); 
	ЕстьПривязанныеСтроки = ТабСтрокиПривязанныеКРеализации.Количество() > 0;  //* не используется пока *//
		
	ЕстьВсеСН = Истина;
	СообщениеНЕдостаточноСерийныхНомеров = "";
	ТЗРезультат = ТабДоступныеСерии.Скопировать();
	ТЗРезультат.Очистить();
	  
	Подобрано = 0;
	Для Каждого СтрокаРеализации Из ТабДоступныеСерии Цикл   
		
		СтруктураОтбора = Новый Структура("Номенклатура",СтрокаРеализации.Номенклатура);
		ДоступныеСерийныеНомера = ТабДоступныеСерии.НайтиСтроки(СтруктураОтбора);
		ПодобранныеСерийныеНомера = ТЗРезультат.НайтиСтроки(СтруктураОтбора);
		Если ПодобранныеСерийныеНомера.Количество() = СтрокаРеализации.КоличествоРеализации Тогда 
			Подобрано = 0; //на всякий случай
			Продолжить;
		КонецЕсли;   
		
		Если ДоступныеСерийныеНомера.Количество() < СтрокаРеализации.КоличествоРеализации Тогда
			СообщениеНЕдостаточноСерийныхНомеров = ?(ЗначениеЗаполнено(СообщениеНЕдостаточноСерийныхНомеров), 
														СообщениеНЕдостаточноСерийныхНомеров + символы.ПС,
														СообщениеНЕдостаточноСерийныхНомеров) + СтрокаРеализации.Номенклатура; 
			ЕстьВсеСН = Ложь; 
			Прервать;
		КонецЕсли;
		
		Для н = 1 по СтрокаРеализации.Количество Цикл
			НоваяСтрока = ТЗРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаРеализации);
			НоваяСтрока.ДокументРеализации = ИсточникРТУ.Ссылка;
			НоваяСтрока.Реализовано = Истина;  
			Подобрано = Подобрано + 1;
		КонецЦикла;
		
		Если Подобрано = СтрокаРеализации.КоличествоРеализации Тогда  
			Подобрано = 0;
		КонецЕсли; 
		
	КонецЦикла;       
	
	ЕстьВсеСерии = ЕстьВсеСН;
	
	Если ЗначениеЗаполнено(СообщениеНЕдостаточноСерийныхНомеров) Тогда 
		ОбщегоНазначения.СообщитьПользователю("Не удалось подобрать достаточно серийных номеров для реализации продукции:" + Символы.ПС + СтрокаРеализации.Номенклатура);
	КонецЕсли; 
	
	Если не ЕстьВсеСерии Тогда 
		Возврат Неопределено;
	Иначе 
		Возврат ТЗРезультат;
	КонецЕсли;
	
КонецФункции  


///////////////////////////////////////////////////////////////////////////

//Функция ПроверитьУстановитьСерийныйНомер(СсылкаНаЭтап)
//		
//КонецФункции

//не отлажена
//Функция УстановитьСерийныйНомер(Номенклатура, Дата, ПорядковыйНомерЕдиницыИзделия, УстановитьСерийныйНомер) Экспорт
//		
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ДополнительныеСведения.Значение КАК КодТМ
//	               |ИЗ
//	               |	Справочник.Номенклатура КАК Номенклатура
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
//	               |		ПО (Номенклатура.Ссылка = (ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.Номенклатура)))
//	               |ГДЕ
//	               |	Номенклатура.Ссылка = &Номенклатура
//	               |	И ДополнительныеСведения.Свойство = &ТТМСвойствоНомерТМ";               
//	ТТМСвойствоНомерТМ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","КодТМ_862b990ca14c4d3480f307b575a5baf4");
//	Запрос.УстановитьПараметр("ТТМСвойствоНомерТМ",ТТМСвойствоНомерТМ);
//	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		КодТМ0 = Выборка.КодТМ;
//		мКодТМ = СтрРазделить(КодТМ0," -+.");
//		ЧастьНомера1 = мКодТМ[1];
//		ЧастьНомера2 = СтрЗаменить(Формат(Дата,"ДФ=yyyy"),"0","") + Формат(Дата,"ДФ=ММ");
//		
//		Запрос = Новый Запрос;
//		Запрос.Текст = "ВЫБРАТЬ
//		               |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура КАК Номенклатура,
//		               |	МАКСИМУМ(ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер) КАК ПоследнийСерийныйНомер
//		               |ИЗ
//		               |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
//		               |ГДЕ
//		               |	ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер ПОДОБНО &НачалоСН
//		               |	И ТТМ_УчетСерийныхНомеровПродукции.Номенклатура = &Номенклатура
//		               |
//		               |СГРУППИРОВАТЬ ПО
//		               |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура";		
//		
//		Запрос.УстановитьПараметр("НачалоСН", СтрШаблон("%1-%2",ЧастьНомера1,ЧастьНомера2)+"%");
//		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
//		
//		РезультатЗапроса = Запрос.Выполнить();
//		
//		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//		
//		ПредыдущйНомер = 100;
//		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//			ПредыдущйНомер = ?(ВыборкаДетальныеЗаписи.ПоследнийСерийныйНомер=NUll,ПредыдущйНомер,Число(Прав(ВыборкаДетальныеЗаписи.ПоследнийСерийныйНомер,5)));
//		КонецЦикла;
//		
//		ЧастьНомера3 = Формат(ПредыдущйНомер+ПорядковыйНомерЕдиницыИзделия,"ЧЦ=4; ЧВН=; ЧГ=0");
//		Возврат СтрШаблон("%1-%2-%3",ЧастьНомера1,ЧастьНомера2,ЧастьНомера3);
//	Иначе     
//		Сообщить("КодТМ для продукции не установлен!",СтатусСообщения.Важное);
//		ПустаяСтр = "";
//		Возврат ПустаяСтр;
//	КонецЕсли;
//	
//КонецФункции
